Autodesk.Revit.DB.ElementTransformUtils.CopyElements(Autodesk.Revit.DB.View,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.View,Autodesk.Revit.DB.Transform,Autodesk.Revit.DB.CopyPasteOptions)
Copies a set of elements from source view to destination view.
Remarks:
This method can be used for both view-specific and model elements.
Both source and destination views must be 2D graphics views capable of drawing details and view-specific elements (floor and ceiling plans, elevations, sections, drafting views.)
Drafting views cannot be used as a destination for model elements.
The pasted elements are repositioned to ensure proper placement in the destination view (e.g. elevation is changed when copying from a level to a different level.)
Additional transformation within the destination view can be performed by providing additionalTransform argument. This additional transformation must be within the plane of the destination view.
The destination view can be in the same document as the source view.
The destination view can be the same as the source view.
All view-specific elements in the set must be specific to the source view. Elements specific to views other than the source view or to multiple views cannot be copied.
This method performs rehosting of elements where applicable.
sourceView:
The view in the source document that contains the elements to copy.
elementsToCopy:
The set of elements to copy.
destinationView:
The view in the destination document that the elements will be pasted into.
additionalTransform:
The transform for the new elements, in addition to the transformation between the source and destination views. Can be null if no transform is required. The transformation must be within the plane of the destination view.
options:
Optional settings. Can be null if default settings should be used.
Returns:
The ids of the newly created copied elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
The specified view cannot be used as a source or destination for copying elements between two views.
-or-
Some of the elements cannot be copied, because they belong to a different document.
-or-
Some of the elements cannot be copied, because they belong to a different view.
-or-
The elements cannot be copied into the destination view. Drafting views cannot contain model elements.
-or-
The transformation is not within the plane of the destination view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The elements cannot be copied.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
User cancelled the operation.
Since:
2014

Autodesk.Revit.DB.ElementTransformUtils.CopyElements(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Transform,Autodesk.Revit.DB.CopyPasteOptions)
Copies a set of elements from source document to destination document.
Remarks:
Copies are placed at their respective original locations or locations specified by the optional transformation.
This method can be used for copying non-view specific elements only. For copying view-specific elements, use the view-specific form of the CopyElements method.
The destination document can be the same as the source document.
This method performs rehosting of elements where applicable.
sourceDocument:
The document that contains the elements to copy.
elementsToCopy:
The set of elements to copy.
destinationDocument:
The destination document to paste the elements into.
transform:
The transform for the new elements. Can be null if no transform is required.
options:
Optional settings. Can be null if default settings should be used.
Returns:
The ids of the newly created copied elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
One or more elements in elementsToCopy do not exist in the document.
-or-
Some of the elements cannot be copied, because they are view-specific.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The elements cannot be copied.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
User cancelled the operation.
Since:
2014

Autodesk.Revit.DB.ElementTransformUtils.MirrorElement(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Plane)
Creates a mirrored copy of an element about a given plane.
document:
The document that owns the element.
elementToMirror:
The element to mirror.
plane:
The mirror plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
elementToMirror cannot be mirrored.
-or-
The element elementToMirror does not exist in the document
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.ElementTransformUtils.MirrorElements(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.Plane,System.Boolean)
Mirrors a set of elements about a given plane.
Remarks:
Optionally, copies of the elements can be created prior to the operation and mirroring is then performed on the copies instead of the original elements.
document:
The document that owns the elements.
elementsToMirror:
The set of elements to mirror.
plane:
The mirror plane.
mirrorCopies:
True if mirroring should be performed on copies of the elements, leaving the original elements intact.
False if no copies should be created and the elements should be mirrored directly.
Returns:
A collection of ids of newly created elements - mirrored copies. It is empty if the mirrorCopies arguments is false.
Throws Autodesk.Revit.Exceptions.ArgumentException:
elementsToMirror cannot be mirrored.
-or-
The given element id set is empty.
-or-
One or more elements in elementsToMirror do not exist in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the elements cannot be moved (e.g. due to some of the elements being pinned).
Since:
2016

Autodesk.Revit.DB.ElementTransformUtils.CopyElement(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ)
Copies an element and places the copy at a location indicated by a given transformation.
document:
The document that owns the element.
elementToCopy:
The id of the element to copy.
translation:
The translation vector for the new element.
Returns:
The ids of the newly created copied elements.  More than one element may be created due to dependencies.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elementToCopy does not exist in the document
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
If we are not able to copy the element.
Since:
2012

Autodesk.Revit.DB.ElementTransformUtils.CopyElements(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.XYZ)
Copies a set of elements and places the copies at a location indicated by a given translation.
Remarks:
This method is not suitable for elements that are hosted in other elements as it does not perform rehosting. If you need to rehost your elements in addition
to copying them, use one of the other CopyElements() overloads.
document:
The document that owns the elements.
elementsToCopy:
The set of elements to copy.
translation:
The translation vector for the new elements.
Returns:
The ids of the newly created copied elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
One or more elements in elementsToCopy do not exist in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
If we are not able to copy all the elements.
Since:
2012